const fieldsStyle = { width: "90%" };

const statusSelect = [
  {
    title: "В работе",
    value: true,
  },
  {
    title: "Неисправно",
    value: false,
  },
];


const marketSelect = [
  { title: "ADEM", value: "ADEM" },
  { title: "Ялян", value: "Ялян" },
  { title: "Алатау-1", value: "Алатау-1" },
  { title: "Алатау-2", value: "Алатау-2" },
  { title: "Болашак", value: "Болашак" },
  { title: "Арлан", value: "Арлан" },
  { title: "Казына", value: "Казына" },
  { title: "Нурлы-Тау", value: "Нурлы-Тау" },
];

const equipmentType = [
  { title: "Стойка въезда", value: "Стойка въезда" },
  { title: "Стойка выезда", value: "Стойка выезда" },
  { title: "Платежный терминал", value: "Платежный терминал" },
];

const equipmentOptions = [
  {
    name: "Болт мотора шлагбаума",
    value: "Болт мотора шлагбаума",
    standFor: "Шлагбаум",
    description: "Крепит мотор шлагбаума",
  },
  {
    name: "Пластиковый болт шлагбаума",
    value: "Пластиковый болт шлагбаума",
    standFor: "Шлагбаум",
    description: "Крепит стрелу шлагбаума",
  },
  {
    name: "Тикет-Ретрактор",
    value: "Тикет-Ретрактор",
    standFor: "Стойка выезда, Платежный терминал",
    description: "Служит для принятия талона",
  },
  {
    name: "Принтер",
    value: "Принтер",
    standFor: "Стойка въезда, Платежный терминал",
    description: "Служит для распечатки талонов и чеков",
  },
  {
    name: "Интерком",
    value: "Интерком",
    standFor: "Стойка въезда, Платежный терминал, Стойка выезда",
    description: "Служит для связи с сотрудниками компании непосредственно с оборудования",
  },
  {
    name: "Монетоприемник",
    value: "Монетоприемник",
    standFor: "Платежный терминал",
    description: "Служит для принятия монет платежным терминалом",
  },
  {
    name: "Механизм монетоприемника",
    value: "Механизм монетоприемника",
    standFor: "Платежный терминал",
    description: "Служит для распределения принятых монет",
  },
  {
    name: "Купюроприемник",
    value: "Купюроприемник",
    standFor: "Платежный терминал",
    description: "Служит для приема купюр платежным терминалом",
  },
  {
    name: "Системный блок",
    value: "Системный блок",
    standFor: "Стойка въезда, Стойка выезда, Платежный терминал",
    description: "Главный системный блок оборудования",
  },
  {
    name: "Баркод сканнер",
    value: "Баркод сканнер",
    standFor: "Платежный терминал, стойка выезда",
    description: "Служит для считывания баркода с талона",
  },
  {
    name: "Дисплей для стойки",
    value: "Дисплей для стойки",
    standFor: "Стойка въезда, Стойка выезда",
    description: "Служит для отображения информации",
  },
  {
    name: "Дисплей для терминала",
    value: "Дисплей для терминала",
    standFor: "Платежный терминал",
    description: "Служит для отображения информации",
  },
  {
    name: "Сенсорная панель",
    value: "Сенсорная панель",
    standFor: "Платежный терминал",
    description: "Служит для взаимодействия с терминалом",
  },
  {
    name: "Кнопки лицевой панели",
    value: "Кнопки лицевой панели",
    standFor: "Стойка въезда, Стойка выезда",
    description: "Служит для выдачи талона и связи с диспетчером",
  },
  {
    name: "Плата ввода-вывода",
    value: "Плата ввода-вывода",
    standFor: "Стойка въезда, Стойка выезда, Платежный терминал",
    description: "Служит для взаимодействия оборудования между собой",
  },
  {
    name: "Механизм купюроприемника",
    value: "Механизм купюроприемника",
    standFor: "Платежный терминал",
    description: "Служит для установки купюроприемника и купюрной кассеты",
  },
  {
    name: "Кассеты купюрные",
    value: "Кассеты купюрные",
    standFor: "Платежный терминал",
    description: "Служит для хранения купюр",
  },
  {
    name: "Другое",
    value: "Другое",
    standFor: "",
    description: "",
  },
  
];

//   

// {
//   name: "",
//   value: "",
//   standFor: "",
//   description: "",
// },

// Стойка въезда
// Стойка выезда
// Платежный терминал


export { statusSelect, marketSelect, equipmentType, fieldsStyle, equipmentOptions };
